import React from 'react';

import css from './about.module.scss';

import Image from 'assets/about.png';
import Button from 'components/button/button';

const About = () => {
  return (
    <section>
      <div className={'container ' + css.About}>
        <h2 className={css.AboutTitle}>Про нас</h2>
        <img className={css.AboutImage} src={Image} alt="Собака" />
        <p className={css.AboutText}>
          В притулку весь час знаходиться 350 дорослих та 20 цуценят. В
          залежності від швидкості прилаштувань цифри змінюються. <br /> Все
          почалося зі співчуття до масово викинутих тварин у місті, доля яких
          всім була байдужою.
          <br /> Власними зусиллями та особистими коштами волонтерів та
          небайдужих людей ми розпочали прилаштування та стерилізацію тварин для
          зменшення кількості безхатьків.
          <br /> За роки нашої праці в рік стерилізується понад 400 тварин, а
          дім знаходять близько 240 безхатьків, деяких вдається прилаштувати
          навіть за кордон.
          <br /> Ми постійно покращуємо умови для проживання собак, проводимо
          ремонтні роботи вольєрів, облагороджуємо територію притулку.
          <br /> Проводимо масову вакцинацію собак, щоб уникнути спалаху
          захворювань.
          <br /> Наша робота вимагає дуже багато зусиль, як фізичних, так і
          фінансових. Допомога від міста полягає тільки у стерилізації та
          кастрації тварин, а всі інші витрати, включно із зарплатою, оплатою
          комунальних послуг, ремонтними роботами та лікуванням хворих тварин -
          це все на руках волонтерів та благодійних коштах.
          <br /> Ми щиро сподіваємося, що наша праця не марна і нас підтримають
          люди по всьому світу!
        </p>
        <Button title="Детальніше" />
      </div>
    </section>
  );
};

export default About;
